# Carga de datos de Census y Generaci√≥n de perfiles

In [1]:
import pandas as pd 
import numpy as np
import psycopg2
import pymysql
from sqlalchemy import create_engine

In [2]:
# engine = create_engine("postgresql+psycopg2://postgres:example@localhost:5432/postgres")

# cursor = conn.cursor()
# cursor.close()

# Carga del dataframe a la base de datos 
# tabla_Seguros.to_sql("SEGUROS", con=engine, index=False, if_exists='append')

# conn.close()

### TABLA STATES

In [119]:
df_states = pd.read_csv("DataCensus/TotalPopulation.csv")
df_states["population"] = df_states["population"].str.replace(',','')
df_states["population"] = df_states["population"].astype(int)

df_states = df_states[["code", "state", "population"]]

In [120]:
df_states.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   code        10 non-null     object
 1   state       10 non-null     object
 2   population  10 non-null     int32
dtypes: int32(1), object(2)
memory usage: 328.0+ bytes

In [121]:
df_states.head()

  code     state  population
0   AZ   Arizona     7276316
1   FL   Florida    21781128
2   GA   Georgia    10799566
3   IL  Illinois    12671469
4   MI  Michigan    10050811

### TABLA AGE

In [61]:
df_age = pd.read_csv("DataCensus/Age.csv")
df_age.head()

     state code  age_min  age_max population
0  Arizona   AZ        0      4.0    402,255
1  Arizona   AZ        5      9.0    446,309
2  Arizona   AZ       10     14.0    476,245
3  Arizona   AZ       15     19.0    482,998
4  Arizona   AZ       20     24.0    488,212

In [62]:
df_age.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       180 non-null    object
 1   code        180 non-null    object
 2   age_min     180 non-null    int64
 3   age_max     170 non-null    float64
 4   population  180 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 7.2+ KB

In [126]:
df_age.fillna(0, inplace=True)

# generaci√≥n de index
df_age2 = df_age.drop(columns=["state"]).reset_index().rename(columns={"index":"id_age"})

# age_max to int 
df_age2["age_max"] = df_age2["age_max"].astype(int)

# population to number 
df_age2["population"] = df_age2["population"].str.replace(',','')
df_age2["population"] = df_age2["population"].astype(int)
df_age2

     id_age code  age_min  age_max  population
0         0   AZ        0        4      402255
1         1   AZ        5        9      446309
2         2   AZ       10       14      476245
3         3   AZ       15       19      482998
4         4   AZ       20       24      488212
..      ...  ...      ...      ...         ...
175     175   VA       65       69      468946
176     176   VA       70       74      386957
177     177   VA       75       79      252737
178     178   VA       80       84      150963
179     179   VA       85        0      146877

[180 rows x 5 columns]

In [65]:
df_age2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_age      180 non-null    int64
 1   code        180 non-null    object
 2   age_min     180 non-null    int64
 3   age_max     180 non-null    float64
 4   population  180 non-null    int32
dtypes: float64(1), int32(1), int64(2), object(1)
memory usage: 6.5+ KB

### TABLA HOSING

In [66]:
df_housing = pd.read_csv("DataCensus/Household Size.csv")
df_housing.head()

     state code  occupients     amount
0  Arizona   AZ           1    741,675
1  Arizona   AZ           2  1,012,068
2  Arizona   AZ           3    411,484
3  Arizona   AZ           4    652,496
4  Florida   FL           1  2,435,836

In [67]:
df_housing.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       40 non-null     object
 1   code        40 non-null     object
 2   occupients  40 non-null     int64
 3   amount      40 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.4+ KB

In [76]:
df_housing2 = df_housing.drop(columns="state").reset_index().rename(columns={"index":"id_housing"})

df_housing2["amount"] = df_housing2["amount"].str.replace(',','')
df_housing2["amount"] = df_housing2["amount"].astype(int)

df_housing2.head()

   id_housing code  occupients   amount
0           0   AZ           1   741675
1           1   AZ           2  1012068
2           2   AZ           3   411484
3           3   AZ           4   652496
4           4   FL           1  2435836

In [77]:
df_housing2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_housing  40 non-null     int64
 1   code        40 non-null     object
 2   occupients  40 non-null     int64
 3   amount      40 non-null     int32
dtypes: int32(1), int64(2), object(1)
memory usage: 1.2+ KB

### TABLA MARITAL

In [78]:
df_marital = pd.read_csv("DataCensus/Marital Status.csv")
df_marital.head()

      state code   status population
0   Arizona   AZ  married  2,898,384
1   Florida   FL  married  8,651,245
2   Georgia   GA  married  4,060,106
3  Illinois   IL  married  4,918,566
4  Michigan   MI  married  3,952,988

In [79]:
df_marital.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       20 non-null     object
 1   code        20 non-null     object
 2   status      20 non-null     object
 3   population  20 non-null     object
dtypes: object(4)
memory usage: 768.0+ bytes

In [82]:
df_marital2 = df_marital.drop(columns="state").reset_index().rename(columns={"index":"id_marital"})

df_marital2["population"] = df_marital2["population"].str.replace(',','')
df_marital2["population"] = df_marital2["population"].astype(int)

df_marital2.head()

   id_marital code   status  population
0           0   AZ  married     2898384
1           1   FL  married     8651245
2           2   GA  married     4060106
3           3   IL  married     4918566
4           4   MI  married     3952988

In [84]:
df_marital2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_marital  20 non-null     int64
 1   code        20 non-null     object
 2   status      20 non-null     object
 3   population  20 non-null     int32
dtypes: int32(1), int64(1), object(2)
memory usage: 688.0+ bytes

### TABLA SEX

In [86]:
df_sex = pd.read_csv("DataCensus/Sex.csv")
df_sex.head()

      state code category  population
0   Arizona   AZ     Male   3,629,620
1   Florida   FL     Male  10,714,520
2   Georgia   GA     Male   5,270,144
3  Illinois   IL     Male   6,264,364
4  Michigan   MI     Male   4,976,869

In [88]:
df_sex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       20 non-null     object
 1   code        20 non-null     object
 2   category    20 non-null     object
 3   population  20 non-null     object
dtypes: object(4)
memory usage: 768.0+ bytes

In [92]:
df_sex2 = df_sex.drop(columns="state").reset_index().rename(columns={"index":"id_sex"})

df_sex2["population"] = df_sex2["population"].str.replace(',','')
df_sex2["population"] = df_sex2["population"].astype(int)

df_sex2.head()

   id_sex code category  population
0       0   AZ     Male     3629620
1       1   FL     Male    10714520
2       2   GA     Male     5270144
3       3   IL     Male     6264364
4       4   MI     Male     4976869

In [94]:
df_sex2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_sex      20 non-null     int64
 1   code        20 non-null     object
 2   category    20 non-null     object
 3   population  20 non-null     int32
dtypes: int32(1), int64(1), object(2)
memory usage: 688.0+ bytes

### TABLE INCOME

In [110]:
df_income = pd.read_csv("DataCensus/Income.csv")
df_income.head()

     state code income_min income_max population
0  Arizona   AZ          0       9999    157,792
1  Arizona   AZ     10,000     14,999     90,167
2  Arizona   AZ     15,000     24,999    200,058
3  Arizona   AZ     25,000     34,999    219,782
4  Arizona   AZ     35,000     49,999    349,398

In [111]:
df_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   state       100 non-null    object
 1   code        100 non-null    object
 2   income_min  100 non-null    object
 3   income_max  90 non-null     object
 4   population  100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

In [112]:
df_income2 = df_income.fillna("0")

df_income2 = df_income2.drop(columns="state").reset_index().rename(columns={"index":"id_income"})

df_income2["income_min"] = df_income2["income_min"].str.replace(',','')
df_income2["income_min"] = df_income2["income_min"].astype(int)

df_income2["income_max"] = df_income2["income_max"].str.replace(',','')
df_income2["income_max"] = df_income2["income_max"].astype(int)

df_income2["population"] = df_income2["population"].str.replace(',','')
df_income2["population"] = df_income2["population"].astype(int)

df_income2.head()

   id_income code  income_min  income_max  population
0          0   AZ           0        9999      157792
1          1   AZ       10000       14999       90167
2          2   AZ       15000       24999      200058
3          3   AZ       25000       34999      219782
4          4   AZ       35000       49999      349398

In [114]:
df_income2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_income   100 non-null    int64
 1   code        100 non-null    object
 2   income_min  100 non-null    int32
 3   income_max  100 non-null    int32
 4   population  100 non-null    int32
dtypes: int32(3), int64(1), object(1)
memory usage: 2.9+ KB

## CARGA DE LAS TABLAS LIMPIAS

In [369]:
engine = create_engine("postgresql+psycopg2://postgres:example@localhost:5433/postgres")

In [122]:
df_states.head()

  code     state  population
0   AZ   Arizona     7276316
1   FL   Florida    21781128
2   GA   Georgia    10799566
3   IL  Illinois    12671469
4   MI  Michigan    10050811

In [128]:
# Carga del dataframe a la base de datos 
df_states.to_sql("states", con=engine, index=False, if_exists='append')

10

In [127]:
df_age2.head()

   id_age code  age_min  age_max  population
0       0   AZ        0        4      402255
1       1   AZ        5        9      446309
2       2   AZ       10       14      476245
3       3   AZ       15       19      482998
4       4   AZ       20       24      488212

In [129]:
df_age2.to_sql("age", con=engine, index=False, if_exists='append')

180

In [131]:
df_housing2.head()

   id_housing code  occupients   amount
0           0   AZ           1   741675
1           1   AZ           2  1012068
2           2   AZ           3   411484
3           3   AZ           4   652496
4           4   FL           1  2435836

In [133]:
df_housing2.to_sql("housing", con=engine, index=False, if_exists='append')

40

In [134]:
df_marital2.head()

   id_marital code   status  population
0           0   AZ  married     2898384
1           1   FL  married     8651245
2           2   GA  married     4060106
3           3   IL  married     4918566
4           4   MI  married     3952988

In [135]:
df_marital2.to_sql("marital", con=engine, index=False, if_exists='append')

20

In [137]:
df_sex2.head()

   id_sex code category  population
0       0   AZ     Male     3629620
1       1   FL     Male    10714520
2       2   GA     Male     5270144
3       3   IL     Male     6264364
4       4   MI     Male     4976869

In [138]:
df_sex2.to_sql("sex", con=engine, index=False, if_exists='append')

20

In [140]:
df_income2.head()

   id_income code  income_min  income_max  population
0          0   AZ           0        9999      157792
1          1   AZ       10000       14999       90167
2          2   AZ       15000       24999      200058
3          3   AZ       25000       34999      219782
4          4   AZ       35000       49999      349398

In [141]:
df_income2.to_sql("income", con=engine, index=False, if_exists='append')

100

# Generaci√≥n de perfiles

In [354]:
def getPerfil(state_code, df_age2, df_housing2, df_marital2, df_sex2, df_income2):
    perfil = {}
    perfil["code"] = state_code

    # Edad
    perfil["fk_age"] = df_age2[df_age2["code"] == state_code].sort_values(by="population", ascending=False).head(1)["id_age"].values[0]

    # Housing
    perfil["fk_housing"] = df_housing2[df_housing2["code"] == state_code].sort_values(by="amount", ascending=False).head(1)["id_housing"].values[0]

    # Marital status
    perfil["fk_marital"] = df_marital2[df_marital2["code"] == state_code].sort_values(by="population", ascending=False).head(1)["id_marital"].values[0]

    # Sex 
    perfil["fk_sex"] = df_sex2[df_sex2["code"] == state_code].sort_values(by="population", ascending=False).head(1)["id_sex"].values[0]

    # Income 
    perfil["fk_income"] = df_income2[df_income2["code"] == state_code].sort_values(by="population", ascending=False).head(1)["id_income"].values[0]

    # print(perfil)
    return perfil

In [356]:
# lista de estados
codes_states = df_states["code"].unique()
codes_states

array(['AZ', 'FL', 'GA', 'IL', 'MI', 'NC', 'OH', 'TN', 'TX', 'VA'],
      dtype=object)

In [357]:
df_profiles = pd.DataFrame({"code":[],
                            "fk_age":[], 
                            "fk_housing":[], 
                            "fk_marital":[], 
                            "fk_sex":[], 
                            "fk_income":[]})


for i in range(len(codes_states)): 
    state = codes_states[i]
    df_profiles.loc[i] = getPerfil(state, df_age2, df_housing2, df_marital2, df_sex2, df_income2)

df_profiles.head(10)

  code  fk_age  fk_housing  fk_marital  fk_sex  fk_income
0   AZ       5           1          10      10          5
1   FL      30           5          11      11         15
2   GA      38           9          12      12         25
3   IL      61          13          13      13         37
4   MI      84          17          14      14         45
5   NC      93          21          15      15         55
6   OH     120          25          16      16         65
7   TN     131          29          17      17         75
8   TX     146          33          18      18         85
9   VA     169          37          19      19         97

In [358]:
df_profiles2 = df_profiles.reset_index().rename(columns={"index":"id_profile"})
df_profiles2

   id_profile code  fk_age  fk_housing  fk_marital  fk_sex  fk_income
0           0   AZ       5           1          10      10          5
1           1   FL      30           5          11      11         15
2           2   GA      38           9          12      12         25
3           3   IL      61          13          13      13         37
4           4   MI      84          17          14      14         45
5           5   NC      93          21          15      15         55
6           6   OH     120          25          16      16         65
7           7   TN     131          29          17      17         75
8           8   TX     146          33          18      18         85
9           9   VA     169          37          19      19         97

In [359]:
df_profiles2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id_profile  10 non-null     int64
 1   code        10 non-null     object
 2   fk_age      10 non-null     int64
 3   fk_housing  10 non-null     int64
 4   fk_marital  10 non-null     int64
 5   fk_sex      10 non-null     int64
 6   fk_income   10 non-null     int64
dtypes: int64(6), object(1)
memory usage: 688.0+ bytes

### Carga de la lista de perfiles

In [371]:
df_profiles2.to_sql("profiles", con=engine, index=False, if_exists='append')

10